src/InformationRegisters/НоменклатураСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КонтрагентыСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СотрудникиСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СпособыФормированияСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыФормированияСегментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПериодическиОбновлять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормироватьВручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СегментыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СегментыНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СегментыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СегментыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СегментыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СегментыСотрудников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/СегментыСервер/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ РЕГЛАМЕНТНЫХ ЗАДАНИЙ

// Выполняет формирование периодических сегментов
//
Процедура ВыполнитьПериодическоеФормирование(Сегмент = Неопределено) Экспорт
	
	Если Сегмент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	// выбрать сегменты, формируемые периодически	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СегментыНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
		|ГДЕ
		|	СегментыНоменклатуры.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять)
		|	И ВЫБОР
		|			КОГДА &Сегмент <> НЕОПРЕДЕЛЕНО
		|				ТОГДА СегментыНоменклатуры.Ссылка = &Сегмент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СегментыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.СегментыКонтрагентов КАК СегментыКонтрагентов
		|ГДЕ
		|	СегментыКонтрагентов.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять)
		|	И ВЫБОР
		|			КОГДА &Сегмент <> НЕОПРЕДЕЛЕНО
		|				ТОГДА СегментыКонтрагентов.Ссылка = &Сегмент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СегментыСотрудников.Ссылка
		|ИЗ
		|	Справочник.СегментыСотрудников КАК СегментыСотрудников
		|ГДЕ
		|	СегментыСотрудников.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять)
		|	И ВЫБОР
		|			КОГДА &Сегмент <> НЕОПРЕДЕЛЕНО
		|				ТОГДА СегментыСотрудников.Ссылка = &Сегмент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ"		
	);
	Запрос.УстановитьПараметр("Сегмент", Сегмент);
	
	Выборка = Запрос.Выполнить().Выбрать();

	// сформировать выбранные сегменты
	Пока Выборка.Следующий() Цикл
		Сформировать(Выборка.Ссылка);
	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Выполняет очистку нединамических сегментов по запланированым датам
//
Процедура ВыполнитьПлановуюОчистку() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	// выбрать сегменты, формируемые вручную с подходящей датой очистки
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СегментыНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
		|ГДЕ
		|	СегментыНоменклатуры.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ФормироватьВручную)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СегментыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.СегментыКонтрагентов КАК СегментыКонтрагентов
		|ГДЕ
		|	СегментыКонтрагентов.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ФормироватьВручную)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СегментыСотрудников.Ссылка
		|ИЗ
		|	Справочник.СегментыСотрудников КАК СегментыСотрудников
		|ГДЕ
		|	СегментыСотрудников.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ФормироватьВручную)"		
	);
	Выборка = Запрос.Выполнить().Выбрать();

	// очистить выбранные сегменты
	Пока Выборка.Следующий() Цикл
		Очистить(Выборка.Ссылка);
	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ И ОЧИСТКИ

// Заполняет регистр сведений объектами, вошедшими в сегмент
Процедура Сформировать(СегментСсылка) Экспорт
	
	// УстановитьПривилегированныйРежим(Истина);
	//
	// СписокЭлементов = СписокЭлементовСКД(СегментСсылка);
	//
	// Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
	//	НаборЗаписей = РегистрыСведений.НоменклатураСегмента.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Сегмент.Установить(СегментСсылка);
	//	Для Каждого Элемент Из СписокЭлементов Цикл
	//		Запись = НаборЗаписей.Добавить();
	//		Запись.Сегмент = СегментСсылка;
	//		Запись.Номенклатура = Элемент.ЭлементСписка;
	//	КонецЦикла;
	// ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
	//	НаборЗаписей = РегистрыСведений.КонтрагентыСегмента.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Сегмент.Установить(СегментСсылка);
	//	Для Каждого Элемент Из СписокЭлементов Цикл
	//		Запись = НаборЗаписей.Добавить();
	//		Запись.Сегмент = СегментСсылка;
	//		Запись.Контрагент = Элемент.ЭлементСписка;
	//	КонецЦикла;		
	// КонецЕсли;
	//
	// НаборЗаписей.Записать();
	//
	// УстановитьПривилегированныйРежим(Ложь);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПОПЫТКА
			
		НачатьТранзакцию();
	
		// Получаем актуальный состав сегмента
		СписокНовыйСоставСегмента = СписокЭлементовСКД(СегментСсылка);
		
		Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
			НаименованиеРегистра = "НоменклатураСегмента";
			НаименованиеОбъекта	 = "Номенклатура";
		ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
			НаименованиеРегистра = "КонтрагентыСегмента";
			НаименованиеОбъекта	 = "Контрагент";
		ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыСотрудников") Тогда
			НаименованиеРегистра = "СотрудникиСегмента";
			НаименованиеОбъекта	 = "Сотрудник";
		Иначе 
			Возврат;
		КонецЕсли;
		
		// Анализируем и получаем строки которые надо удалить
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сегмент"               , СегментСсылка);
		Запрос.УстановитьПараметр("МассивОбъектовСегмента", СписокНовыйСоставСегмента.ВыгрузитьКолонку("ЭлементСписка"));	
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоставСегментов.Сегмент КАК Сегмент,
		|	СоставСегментов.&НаименованиеОбъекта КАК ОбъектСегмента
		|ИЗ
		|	РегистрСведений.&НаименованиеРегистра КАК СоставСегментов
		|ГДЕ
		|	СоставСегментов.Сегмент = &Сегмент
		|	И НЕ СоставСегментов.&НаименованиеОбъекта В (&МассивОбъектовСегмента)";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НаименованиеОбъекта"	, НаименованиеОбъекта);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НаименованиеРегистра", НаименованиеРегистра);
		
		ТаблицаСоставаДляУдаления = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаТЗ Из ТаблицаСоставаДляУдаления Цикл
			
			ЗаписьСоставаСегмента               		 = РегистрыСведений[НаименованиеРегистра].СоздатьМенеджерЗаписи();
			ЗаписьСоставаСегмента.Сегмент       	  	 = СегментСсылка;
			ЗаписьСоставаСегмента[НаименованиеОбъекта]	 = СтрокаТЗ.ОбъектСегмента;
			ЗаписьСоставаСегмента.Удалить();
			
		КонецЦикла;
		
		// Анализируем и получаем строки которые надо добавляем
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сегмент"                , СегментСсылка);
		Запрос.УстановитьПараметр("ТаблицаОбъектовСегмента", СписокНовыйСоставСегмента);	
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&Сегмент КАК Сегмент,
		|	АктуальныеОбъектыСегмента.ЭлементСписка КАК ОбъектСегмента
		|ПОМЕСТИТЬ АктуальныеОбъектыСегмента
		|ИЗ
		|	&ТаблицаОбъектовСегмента КАК АктуальныеОбъектыСегмента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктуальныеОбъектыСегмента.Сегмент КАК Сегмент,
		|	АктуальныеОбъектыСегмента.ОбъектСегмента КАК &НаименованиеОбъекта
		|ИЗ
		|	АктуальныеОбъектыСегмента КАК АктуальныеОбъектыСегмента
		|ГДЕ
		|	АктуальныеОбъектыСегмента.Сегмент = &Сегмент
		|	И НЕ АктуальныеОбъектыСегмента.ОбъектСегмента В
		|				(ВЫБРАТЬ
		|					СоставСегментов.&НаименованиеОбъекта
		|				ИЗ
		|					РегистрСведений.&НаименованиеРегистра КАК СоставСегментов
		|				ГДЕ
		|					СоставСегментов.Сегмент = &Сегмент)";
				   
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НаименованиеОбъекта"	, НаименованиеОбъекта);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НаименованиеРегистра", НаименованиеРегистра);
		
		ТаблицаСоставаДляДобавления = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаСоставаДляДобавления.Количество() > 0 Тогда
			
			НаборЗаписейСоставСегментов = РегистрыСведений[НаименованиеРегистра].СоздатьНаборЗаписей();
			НаборЗаписейСоставСегментов.Отбор.Сегмент.Установить(СегментСсылка);
			НаборЗаписейСоставСегментов.Загрузить(ТаблицаСоставаДляДобавления);		
			НаборЗаписейСоставСегментов.Записать(Ложь);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	    
	ИСКЛЮЧЕНИЕ
		
		ОписОшибки = ОписаниеОшибки();
		ОтменитьТранзакцию();
		
	КОНЕЦПОПЫТКИ;

	
КонецПроцедуры

// Формирует табличный документ с элементами по правилам формирования сегмента
//
Процедура СкомпоноватьПоСегменту(СегментСсылка, ТабличныйДокумент, АдресРасшифровки = Неопределено, АдресСКД = Неопределено) Экспорт

	ТабличныйДокумент.Очистить();
	
	СхемаКомпоновкиДанных = ?(АдресСКД = Неопределено, ПолучитьСКД(СегментСсылка), ПолучитьИзВременногоХранилища(АдресСКД));
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;	
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	ПроцессорВывода.ЗакончитьВывод();
	
	АдресРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, Новый УникальныйИдентификатор);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает результат запроса, определяющего набор элементов сегмента,
// из регистров сведений (применяется для нединамических сегментов)
//
Функция ВыборкаИзРегистра(СегментСсылка)
	
	Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоменклатураСегмента.Номенклатура
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|ГДЕ
		|	НоменклатураСегмента.Сегмент = &Сегмент"
		);
		Запрос.УстановитьПараметр("Сегмент", СегментСсылка);
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентыСегмента.Контрагент
		|ИЗ
		|	РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|ГДЕ
		|	КонтрагентыСегмента.Сегмент = &Сегмент"
		);
		Запрос.УстановитьПараметр("Сегмент", СегментСсылка);
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыСотрудников") Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиСегмента.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
		|ГДЕ
		|	СотрудникиСегмента.Сегмент = &Сегмент"
		);
		Запрос.УстановитьПараметр("Сегмент", СегментСсылка);		
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Возвращает таблицу значений, содержащую ссылки на элементы,
// входящие в сегмент, по настройкам СКД
//
Функция СписокЭлементовСКД(СегментСсылка)
	
	Настройки = ПолучитьНастройкиСписка(СегментСсылка);
	Возврат ТаблицаСКД(Настройки.СКД, Настройки.Настройки);
	
КонецФункции

// Возвращает структуру, содержащую СКД сегмента и настройки варианта,
// содержащего список элементов. При этом подключаются поля запроса списка.
//
Функция ПолучитьНастройкиСписка(СегментСсылка, АдресСКД = Неопределено)
	
	// СКД = СегментСсылка.СхемаКомпоновкиДанных.Получить();
	СКД = ?(АдресСКД = Неопределено, СегментСсылка.СхемаКомпоновкиДанных.Получить(), ПолучитьИзВременногоХранилища(АдресСКД));
	
	// подключить поля запроса списка
	Поля = СКД.НаборыДанных.СписокСегмента.Поля;
	Для Каждого Поле Из Поля Цикл
		Поле.ОграничениеИспользования.Поле = Ложь;
	КонецЦикла;// подключить поля запроса списка
	
	НастройкиСписка = СКД.ВариантыНастроек.Список.Настройки;
	Настройки = СКД.НастройкиПоУмолчанию;
	ОбщегоНазначенияКлиентСерверСтоматология.СкопироватьЭлементы(НастройкиСписка.ПараметрыДанных, Настройки.ПараметрыДанных);
	ОбщегоНазначенияКлиентСерверСтоматология.СкопироватьЭлементы(НастройкиСписка.Отбор, Настройки.Отбор);
	
	Возврат Новый Структура("СКД, Настройки", СКД, НастройкиСписка);
	
КонецФункции

// Формирует и возвращает таблицу значений по СКД и настройкам
// Параметры:
// СКД - схема компоновки данных,
// Настройки - вариант настроек схемы, по которым необходимо сформировать таблицу
//
Функция ТаблицаСКД(СКД, Настройки)
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Колонка = ТаблицаЗначений.Колонки.Найти("Контрагент");
	Если Колонка <> Неопределено Тогда
		Колонка.Имя = "ЭлементСписка";
	КонецЕсли;	
	Колонка = ТаблицаЗначений.Колонки.Найти("Номенклатура");
	Если Колонка <> Неопределено Тогда
		Колонка.Имя = "ЭлементСписка";
	КонецЕсли;
	ТаблицаЗначений.Свернуть("ЭлементСписка");
	
	Возврат ТаблицаЗначений;
	
КонецФункции

// Возвращает таблицу значений, содержащую ссылки на элементы,
// входящие в сегмент, по настройкам СКД
//
Функция ПолучитьПризнакЗаполненностиНастроек(СегментСсылка, АдресСКД = Неопределено) Экспорт
	
	Результат = Ложь;
	
	Настройки = ПолучитьНастройкиСписка(СегментСсылка, АдресСКД);
	Для Каждого НастройкаЭлемент Из Настройки.Настройки.Отбор.Элементы Цикл
		Если НастройкаЭлемент.Использование = Истина Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ И ОЧИСТКИ

// Удаляет из регистра сведений записи, относящиеся к сегменту
Процедура Очистить(СегментСсылка) Экспорт
	
	Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		НаборСегмента = РегистрыСведений.НоменклатураСегмента.СоздатьНаборЗаписей();
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
		НаборСегмента = РегистрыСведений.КонтрагентыСегмента.СоздатьНаборЗаписей();
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыСотрудников") Тогда
		НаборСегмента = РегистрыСведений.СотрудникиСегмента.СоздатьНаборЗаписей();
	Иначе 
		Возврат;
	КонецЕсли;
	
	НаборСегмента.Отбор.Сегмент.Установить(СегментСсылка);
	НаборСегмента.Записать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ СХЕМЫ КОМПОНОВКИ

// Возвращает схему компоновки данных сегмента с учетом способа формирования сегмента
//
Функция ПолучитьСКД(СегментСсылка) Экспорт
	
	СКД = СегментСсылка.СхемаКомпоновкиДанных.Получить();
	
	ОтключитьКолонку("Полное наименование", СКД);
	
	НаборСписка = СКД.НаборыДанных.Найти("СписокСегмента");
	
	// заменить запрос списка на обращение к регистру
	Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		НаборСписка.Запрос = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоменклатураСегмента.Номенклатура КАК ЭлементСписка,
		|	НоменклатураСегмента.Сегмент
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента";
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
		НаборСписка.Запрос =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентСегмента.Контрагент КАК ЭлементСписка,
		|	КонтрагентСегмента.Сегмент КАК Сегмент
		|ИЗ
		|	РегистрСведений.КонтрагентыСегмента КАК КонтрагентСегмента";
	ИначеЕсли ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыСотрудников") Тогда
		НаборСписка.Запрос =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиСегмента.Сотрудник КАК ЭлементСписка,
		|	СотрудникиСегмента.Сегмент КАК Сегмент
		|ИЗ
		|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента";
		
	КонецЕсли; // заменить запрос списка на обращение к регистру
	
	// удалить отбор, соответствующий старому запросу
	ЭлементыОтбора = СКД.НастройкиПоУмолчанию.Отбор.Элементы;
	ЭлементыОтбора.Очистить();
	
	// добавить отбор по сегменту
		ОбщегоНазначенияКлиентСерверСтоматология.ДобавитьОтбор(
			СКД.НастройкиПоУмолчанию, Новый ПолеКомпоновкиДанных("Сегмент"), СегментСсылка
		);
	
	// включить автозаполнение полей
	СКД.НаборыДанных.СписокСегмента.АвтоЗаполнениеДоступныхПолей = Истина;
	
	Возврат(СКД);
	
КонецФункции

// Сохраняет схему компоновки данных сегмента в новое хранилище значения
//
Функция СохранитьСКД(ДанныеФормыОбъект, СхемаКомпоновки) Экспорт
	
	ДанныеФормыОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновки);
	ДанныеФормыОбъект.Записать();
	Возврат ДанныеФормыОбъект;
	
КонецФункции

// Процедура отключает колонку
//
Процедура ОтключитьКолонку(ИмяКолонки, СКД)
	
	Для Каждого Вариант Из СКД.ВариантыНастроек Цикл 
		Если Вариант.Имя = "Основной" Тогда 
			Для Каждого Колонка Из СКД.ВариантыНастроек.Основной.Настройки.Выбор.Элементы Цикл 
				Если Колонка.Заголовок = ИмяКолонки Тогда 
					Колонка.Использование = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ОБРАБОТКИ НАБОРА ЭЛЕМЕНТОВ

// Возвращает список значений, содержащий элементы, входящие в сегмент,
// с учетом способа формирования сегмента
//
Функция СписокЗначений(СегментСсылка) Экспорт
	
	Список = Новый СписокЗначений();
	Список.ЗагрузитьЗначения(ТаблицаЗначений(СегментСсылка).ВыгрузитьКолонку(0));
	Возврат Список;
	
КонецФункции

// Возвращает таблицу значений, содержащую элементы, входящие в сегмент,
// с учетом способа формирования сегмента
//
Функция ТаблицаЗначений(СегментСсылка) Экспорт
	         
	Возврат ВыборкаИзРегистра(СегментСсылка).Выгрузить();
	
КонецФункции

// Возвращает массив элементов, входящих в сегмент,
// с учетом способа формирования сегмента
//
Функция МассивЭлементов(СегментСсылка) Экспорт
	
	Возврат ТаблицаЗначений(СегментСсылка).ВыгрузитьКолонку(0);
	
КонецФункции

// Возвращает количество объектов, отнесенных к сегменту,
// с учетом способа формирования сегмента
//
Функция КоличествоЭлементов(СегментСсылка) Экспорт
	
	Выборка = ВыборкаИзРегистра(СегментСсылка);
	Если Выборка.Пустой() Тогда
		Возврат 0;
	Иначе
		Возврат Выборка.Выбрать().Количество();
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ФОРМ И МОДУЛЕЙ ОБЪЕКТОВ СПРАВОЧНИКОВ СЕГМЕНТОВ

Процедура СегментОбъектПередЗаписью(Объект, Отказ) Экспорт
	
	Если Отказ ИЛИ Объект.ОбменДанными.Загрузка ИЛИ Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// Создание регламентное задание (получение уникального идентификатора)
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Объект.РегламентноеЗадание);
	Если Задание = Неопределено И Объект.СпособФормирования = Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять Тогда
		
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ФормированиеСегментов);
		Задание.Использование = Истина;
		Задание.Наименование = НСтр("ru = 'Формирование сегмента: '") + СокрЛП(Объект.Наименование);
		Задание.Записать();
		
		Объект.РегламентноеЗадание = Задание.УникальныйИдентификатор;
		
	КонецЕсли;
	
	Объект.ДополнительныеСвойства.Вставить("Задание",Задание);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура СегментПриЗаписи(Объект, Отказ) Экспорт
	
	Если Отказ ИЛИ Объект.ОбменДанными.Загрузка ИЛИ Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДополнительныеСвойства.Свойство("Задание") Тогда
		Задание = Объект.ДополнительныеСвойства.Задание;
		Если Задание = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	
	ЗаданиеИзменено = Ложь;
	
	Если Объект.СпособФормирования <> Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять Тогда
		
		Задание.Использование = Ложь;
		ЗаданиеИзменено = Истина;
		
	КонецЕсли;
	
	// Расписание устанавливается в форме элемента
	Если Объект.ДополнительныеСвойства.Свойство("Расписание") 
			И ТипЗнч(Объект.ДополнительныеСвойства.Расписание) = Тип("РасписаниеРегламентногоЗадания")
			И Строка(Объект.ДополнительныеСвойства.Расписание) <> Строка(Задание.Расписание)
		Тогда
		Задание.Расписание = Объект.ДополнительныеСвойства.Расписание;
		ЗаданиеИзменено = Истина;
	КонецЕсли;
	
	// Использование устанавливается в форме элемента
	Если (Объект.ПометкаУдаления И Задание.Использование) ИЛИ Объект.СпособФормирования <> Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять Тогда
		
		Задание.Использование = Ложь;
		ЗаданиеИзменено = Истина;
		
	Иначе
			
		Задание.Использование = Истина;
		ЗаданиеИзменено = Истина;
		
	КонецЕсли;

	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
		
		НаименованиеЗадания = НСтр("ru = 'Формирование сегмента контрагентов: '");
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		
		НаименованиеЗадания = НСтр("ru = 'Формирование сегмента номенклатуры: '");
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.СегментыСотрудников") Тогда
		
		НаименованиеЗадания = НСтр("ru = 'Формирование сегмента сотрудников: '");
				
	КонецЕсли;
	
	НаименованиеЗадания = НаименованиеЗадания + СокрЛП(Объект.Наименование);
	Если Задание.Наименование <> НаименованиеЗадания Тогда
		Задание.Наименование = НаименованиеЗадания;
		ЗаданиеИзменено = Истина;
	КонецЕсли;
	
	Если Задание.Параметры.Количество() <> 1 ИЛИ Задание.Параметры[0] <> Объект.Ссылка Тогда
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(Объект.Ссылка);
		Задание.Параметры = ПараметрыЗадания;
		ЗаданиеИзменено = Истина;
	КонецЕсли;
		
	Если ЗаданиеИзменено Тогда
		УстановитьПривилегированныйРежим(Истина);
		Задание.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
